const config = require('../settings')
const { cmd, commands } = require('../lib/command')
const imageUrl = 'පොටො එක දගනිම්';

const os = require("os");
const { runtime } = require('../lib/functions');


cmd({
    pattern: "menu",
    react: "📜",
    alias: ["panel", "commands"],
    desc: "Get Bot Menu",
    category: "main",
    use: '.menu',
    filename: __filename
},
async (conn, mek, m, { from, quoted, pushname, reply }) => {
    try {
        const selectionMessage = `
*╭────────────●●►*
      𝑯𝑰......🦁 *${pushname}*
     *𝐆𝐎𝐉𝐎 𝐌𝐃 𝑪𝑶𝑴𝑴𝑨𝑵𝑫 𝑳𝑰𝑺𝑻*
╰━━━━∙⋆⋅⋆∙━ ─┉─ • ─┉─⊷◆◆◆

*╭────────────●●►*
*│🅻︎🅸︎🆂︎🆃︎ 🅼︎🅴︎🅽︎🆄︎......💀*
*│⟻⟻⟻⟻⟻⟻⟻*
*│1. 𝘿𝙤𝙬𝙣𝙡𝙤𝙙 𝙢𝙚𝙣𝙪  📥*
*│2. 𝙨𝙚𝙖𝙧𝙘𝙝 𝙢𝙚𝙣𝙪 🔍* 
*│3. 𝘼𝙞 𝙢𝙚𝙣𝙪 🧠*
*│4. 𝙤𝙬𝙚𝙣𝙚𝙧 𝙢𝙚𝙣𝙪 👨‍💻*
*│5. 𝙂𝙧𝙤𝙪𝙥 𝙢𝙚𝙣𝙪 👥*
*│6. 𝗶𝗻𝗳𝗼 𝗺𝗲𝗻𝘂 🧧*
*│7. 𝗳𝘂𝗻 𝗺𝗲𝗻𝘂 😹*
*╰────────────●●►*
𝐑ᴇᴘʟʏ 𝐓ʜᴇ 𝐍ᴜᴍʙᴇʀ 𝐘ᴏᴜ 𝐖ᴀɴᴛ 𝐓ᴏ 𝐒ᴇʟᴇᴄᴛ.......👁️🦁
`;

await conn.sendMessage(from, {
        video: {
            url: 'https://github.com/sulamadara1147/data/blob/main/VID-20250415-WA0268.mp4?raw=true'
        },
        mimetype: 'video/mp4',
        ptv: true
    }, { quoted: mek });

        const sentMsg = await conn.sendMessage(from, {
            image: { url: imageUrl },
            caption: selectionMessage,
            contextInfo: { forwardingScore: 999, isForwarded: true },
        }, { quoted: mek });

        // පරිශීලක ප්‍රතිචාර ලබා ගැනීම
        conn.ev.on('messages.upsert', async (msgUpdate) => {
            const msg = msgUpdate.messages[0];
            if (!msg.message || !msg.message.extendedTextMessage) return;

            const userResponse = msg.message.extendedTextMessage.text.trim();
            if (msg.message.extendedTextMessage.contextInfo &&
                msg.message.extendedTextMessage.contextInfo.stanzaId === sentMsg.key.id) {

                let responseText;

                switch (userResponse) {
                    case '1': // DOWNLOAD MENU
                        responseText = `
*╭──❒⁠⁠⁠⁠* *📥 𝐃ᴏᴡɴʟ 𝐎ᴀᴅᴇʀ-𝐌ᴇɴᴜ 📥* *❒⁠⁠⁠⁠* 
 ╭────────✵✵
*┋*  *𝐬𝚘𝚗𝚐*
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  *𝚢𝚝𝚟*
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  *𝚍𝚘𝚠𝚗𝚕𝚘𝚍*
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  *𝚏𝚋*
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  *𝚊𝚙𝚔*
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  *𝚐𝚍𝚛𝚒𝚟𝚎*
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  *𝚖𝚘𝚟𝚒𝚎*
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  *𝚜𝚕𝚊𝚗𝚒𝚖𝚎𝚌𝚕𝚞𝚋*
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  *𝚡𝚟𝚍𝚕*
 ╰───────────────✵✵
 
  ╭────────✵✵
*┋*  *pastpp*
 ╰───────────────✵✵
  ╭────────✵✵
*┋*  *tt/tiktok*
 ╰───────────────✵✵

> 𝐏𝐎𝐖𝐄𝐑𝐃 𝐁𝐘 𝐆𝐎𝐉𝐎_𝐌𝐃......👁️💀
`;
                        break;
                    case '2': // SEARCH MENU
                        responseText = `
*╭────❒⁠⁠⁠⁠* *🔎 𝐒ᴇᴀʀᴄʜ-𝐌ᴇɴᴜ 🔍* *❒⁠⁠⁠⁠* 
 ╭────────✵✵
*┋*  *weather*
 ╰───────────────✵✵

> 𝐏𝐎𝐖𝐄𝐑𝐃 𝐁𝐘 𝐆𝐎𝐉𝐎_𝐌𝐃......👁️💀
`;
                        break;
                    case '3': // AI MENU
                        responseText = `
*╭────❒⁠⁠⁠⁠* *🧠 𝐀ɪ-𝐌ᴇɴᴜ  🧠* *❒⁠⁠⁠⁠* 
 ╭────────✵✵
*┋*  *𝐚𝚒*
 ╰───────────────✵✵
 
 ╭────────✵✵
*┋*  *𝐠𝚎𝚖𝚒𝚗𝚒*
 ╰───────────────✵✵

> 𝐏𝐎𝐖𝐄𝐑𝐃 𝐁𝐘 𝐆𝐎𝐉𝐎_𝐌𝐃......👁️💀
`;
                        break;
                    case '4': // OWNER MENU
                        responseText = `
*╭────❒⁠⁠⁠⁠* *👨‍💻 𝐎ᴡɴᴇʀ-𝐌ᴇɴᴜ 👨‍💻* *❒⁠⁠⁠⁠* 
 ╭────────✵✵
*┋*  *getpp*
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  *vv*
 ╰───────────────✵✵

 ╭────────✵✵
*┋*  *𝐛𝚕𝚘𝚌𝚔*
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  *𝐮𝚗𝚋𝚕𝚘𝚌𝚔*
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  *𝐣𝚒𝚍*
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  *𝚏𝚘𝚛𝚠𝚊𝚛𝚍*
 ╰───────────────✵✵
  ╭────────✵✵
*┋*  *ginfo*
 ╰───────────────✵✵
 
> 𝐏𝐎𝐖𝐄𝐑𝐃 𝐁𝐘 𝐆𝐎𝐉𝐎_𝐌𝐃......👁️💀
`;
                        break;
                    case '5': // GROUP MENU
                        responseText = `
*╭────❒⁠⁠⁠⁠* *👥 𝐆ʀᴏᴜᴘ-𝐌ᴇɴᴜ 👥* *❒⁠⁠⁠⁠* 
 ╭────────✵✵
*┋*  *𝐦𝚞𝚝𝚎*
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  *𝐮𝚗𝚖𝚞𝚝𝚎*
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  *𝐩𝚛𝚘𝚖𝚘𝚝𝚎*
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  *𝐝𝚎𝚖𝚘𝚝𝚎*
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  *𝐝𝚎𝚕*
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  *𝐣𝚘𝚒𝚗*
 ╰───────────────✵✵
 

> 𝐏𝐎𝐖𝐄𝐑𝐃 𝐁𝐘 𝐆𝐎𝐉𝐎_𝐌𝐃......👁️💀
`;
                        break;
                    case '6': // INFO MENU
                        responseText = `
*╭────❒⁠⁠⁠⁠* *💾 𝐈ɴꜰᴏ-𝐌ᴇɴᴜ 💾* *❒⁠⁠⁠⁠* 
 ╭────────✵✵
*┋*  *𝐚𝚕𝚒𝚟𝚎*
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  *𝐦𝚎𝚗𝚞*
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  *𝐨𝚠𝚗𝚎𝚛*
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  *𝐩𝚒𝚗𝚐*
 ╰───────────────✵✵
 
 *┋*  *𝐬𝚎𝚝𝚝𝚒𝚗𝚐*
 ╰───────────────✵✵
*╰─────────────────❒*

> 𝐏𝐎𝐖𝐄𝐑𝐃 𝐁𝐘 𝐆𝐎𝐉𝐎_𝐌𝐃......👁️💀
`;                   break;
                    case '7': // FUN MENU
                        responseText = `
*╭────❒⁠⁠⁠⁠* *🔄 𝐅un-𝐌ᴇɴᴜ 🔄* *❒⁠⁠⁠⁠* 
 ╭────────✵✵
*┋*  *hack*
 ╰───────────────✵✵
 

> 𝐏𝐎𝐖𝐄𝐑𝐃 𝐁𝐘 𝐆𝐎𝐉𝐎_𝐌𝐃......👁️💀
`;
                        break;
                    case '8': // WALLPAPERS MENU
                        responseText = `
*╭────❒⁠⁠⁠⁠* *⛱️ 𝐑ᴀɴᴅᴏᴍ-𝐌ᴇɴᴜ ⛱️* *❒⁠⁠⁠⁠* 
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
*╰─────────────────❒*

> 𝐏𝐎𝐖𝐄𝐑𝐃 𝐁𝐘 𝐆𝐎𝐉𝐎_𝐌𝐃......👁️💀
`;
                        break;
                    case '9': // WALLPAPER MENU
                        responseText = `
*╭────❒⁠⁠⁠⁠* *🏜️ 𝐖ᴀʟʟᴘᴀᴘᴇʀꜱ-𝐌ᴇɴᴜ 🏜️* *❒⁠⁠⁠⁠* 
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
  ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
*╰─────────────────❒*

> 𝐏𝐎𝐖𝐄𝐑𝐃 𝐁𝐘 𝐆𝐎𝐉𝐎_𝐌𝐃......👁️💀
`;
                        break;
                    case '10': // OTHER MENU
                        responseText = `
*╭────❒⁠⁠⁠⁠* *🌐 𝐎ᴛʜᴇʀ-𝐌ᴇɴᴜ 🌐* *❒⁠⁠⁠⁠* 
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
*╰─────────────────❒*

> 𝐏𝐎𝐖𝐄𝐑𝐃 𝐁𝐘 𝐆𝐎𝐉𝐎_𝐌𝐃......👁️💀
`;
                        break;
                    case '11': // OTHER MENU
                        responseText = `
*╭────❒⁠⁠⁠⁠* *📌 𝐀𝚞𝚝𝚘 𝐌ᴇɴᴜ 📌* *❒⁠⁠⁠⁠* 
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
 ╭────────✵✵
*┋*  **
 ╰───────────────✵✵
*╰─────────────────❒*

> 𝐏𝐎𝐖𝐄𝐑𝐃 𝐁𝐘 𝐆𝐎𝐉𝐎_𝐌𝐃......👁️💀
`;
                        break;
                    default:
                        responseText = "*❌ Invalid option. Please enter a valid number (1-10)*";
                }

                // තෝරාගත් මෙනුව WhatsApp chat එකට යවයි.
                await conn.sendMessage(from, { text: responseText }, { quoted: mek });
            }
        });

    } catch (e) {
        console.error(e);
        reply(`*⚠ An error occurred: ${e.message}*`);
    }
});
